{ "type": "success", "value": [ { "id": 335, "joke": "Chuck Norris likes his coffee half and half: half coffee grounds, half wood-grain alcohol.", "categories": [] }, { "id": 21, "joke": "Chuck Norris doesn't shower, he only takes blood baths.", "categories": [] }, { "id": 531, "joke": "Jesus can walk on water, but Chuck Norris can swim through land.", "categories": [] }, { "id": 347, "joke": "Some people ask for a Kleenex when they sneeze, Chuck Norris asks for a body bag.", "categories": [] }, { "id": 358, "joke": "The 11th commandment is ?Thou shalt not piss off Chuck Norris? This commandment is rarely enforced, as it is impossible to accomplish.", "categories": [] }, { "id": 345, "joke": "When in a bar, you can order a drink called a &quot;Chuck Norris&quot;. It is also known as a &quot;Bloody Mary&quot;, if your name happens to be Mary.", "categories": [] }, { "id": 363, "joke": "When Chuck Norris goes to out to eat, he orders a whole chicken, but he only eats its soul.", "categories": [] }, { "id": 315, "joke": "Chuck Norris never goes to the dentist because his teeth are unbreakable. His enemies never go to the dentist because they have no teeth.", "categories": [] }, { "id": 542, "joke": "Chuck Norris types with one finger. He points it at the keyboard and the keyboard does the rest.", "categories": ["nerdy"] }, { "id": 282, "joke": "Chuck Norris can skeletize a cow in two minutes.", "categories": [] }, { "id": 318, "joke": "If you work in an office with Chuck Norris, don't ask him for his three-hole-punch.", "categories": [] }, { "id": 181, "joke": "Chuck Norris recently had the idea to sell his urine as a canned beverage. We know this beverage as Red Bull.", "categories": [] }, { "id": 349, "joke": "A man once asked Chuck Norris if his real name is &quot;Charles&quot;. Chuck Norris did not respond, he simply stared at him until he exploded.", "categories": [] }, { "id": 204, "joke": "Nagasaki never had a bomb dropped on it. Chuck Norris jumped out of a plane and punched the ground", "categories": [] }, { "id": 297, "joke": "Noah was the only man notified before Chuck Norris relieved himself in the Atlantic Ocean.", "categories": [] }, { "id": 411, "joke": "The pen is mightier than the sword, but only if the pen is held by Chuck Norris.", "categories": [] }, { "id": 502, "joke": "Chuck Norris insists on strongly-typed programming languages.", "categories": ["nerdy"] }, { "id": 28, "joke": "Chuck Norris is not hung like a horse. Horses are hung like Chuck Norris.", "categories": [] }, { "id": 255, "joke": "Chuck Norris does not have to answer the phone. His beard picks up the incoming electrical impulses and translates them into audible sound.", "categories": [] }, { "id": 284, "joke": "Chuck Norris' first job was as a paperboy. There were no survivors.", "categories": [] }, { "id": 13, "joke": "Chuck Norris once challenged Lance Armstrong in a &quot;Who has more testicles?&quot; contest. Chuck Norris won by 5.", "categories": ["explicit"] }, { "id": 70, "joke": "Chuck Norris' house has no doors, only walls that he walks through.", "categories": [] }, { "id": 179, "joke": "Chuck Norris? favourite cut of meat is the roundhouse.", "categories": [] }, { "id": 517, "joke": "Chuck Norris solved the halting problem.", "categories": ["nerdy"] }, { "id": 209, "joke": "That's not Chuck Norris doing push-ups -- that's Chuck Norris moving the Earth away from the path of a deadly asteroid.", "categories": [] }, { "id": 151, "joke": "Chuck Norris doesn't step on toes. Chuck Norris steps on necks.", "categories": [] }, { "id": 143, "joke": "Chuck Norris eats beef jerky and craps gunpowder. Then, he uses that gunpowder to make a bullet, which he uses to kill a cow and make more beef jerky. Some people refer to this as the &quot;Circle of Life.&quot;", "categories": [] }, { "id": 555, "joke": "Chuck Norris doesn't have pubic hairs because hair doesn't grow on balls of steal.", "categories": ["explicit"] }, { "id": 525, "joke": "Chuck Norris can retrieve anything from /dev/null.", "categories": ["nerdy"] }, { "id": 390, "joke": "Divide Chuck Norris by zero and you will in fact get one........one bad-ass that is.", "categories": [] }, { "id": 203, "joke": "Chuck Norris can lead a horse to water AND make it drink.", "categories": [] } ]  }